In [295]:
import requests
import numpy as np
import pandas as pd
import sklearn.ensemble as sk
import sklearn
import statsmodels.api as sm
import matplotlib.pyplot as plt
%matplotlib inline
%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [296]:
train=pd.read_csv('train.csv')
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,NaN,Q

In [297]:
train.shape

(891, 12)

In [298]:
train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [299]:
title_dic={' Mr. ':0, ' Mrs.':1, ' Miss':2, ' Mast':3, ' Don.':4, ' Rev.':5, ' Dr. ':6,
       ' Mme.':7, ' Ms. ':8, ' Majo':9, ' Lady':10, ' Sir.':11, ' Mlle':12, ' Col.':13,
       ' Capt':14, ' the ':15, ' Jonk':16, ' Dona':17}
def add_title(train):
    #title
    train['Title']=map(lambda x: x[x.index(',')+1:x.index(',')+6],train['Name'])
    titles=train['Title'].unique()
    titles
    train['Title']=map(lambda x: title_dic[x],train['Title'])

    return train

def filling_age(train):
    meanlist=[train[train['Title']==x]['Age'].mean() for x in title_dic.values()]
    meanlist=pd.DataFrame(meanlist)
    meanlist['Title']=[title_dic[title_dic.keys()[x]] for x in np.arange(0,18,1)]
    meanlist.columns=['mean','Title']
    
    train=pd.merge(train,meanlist,how='outer',on='Title')
    train=train.dropna(subset=['PassengerId'])
    train=train.sort('PassengerId')
    train=train.reset_index(drop=True)
    
    train.loc[train['Age'].isnull(),'Age'] = train['mean']
    train['Embarked'].fillna('Missing',inplace=True)
    train['Cabin'].fillna('Missing',inplace=True)
    train['Sex'].fillna('Missing',inplace=True)
    train['Fare'].fillna(np.mean(train['Fare']),inplace=True)##########
    train['Age'].fillna(np.mean(train['Age']),inplace=True)##########
    
    sex_dic={'male':0,'female':1,'Missing':2}
    embarked_dic={'S':0,'C':1,'Q':2,'Missing':3}
    train['Sex']=map(lambda x: sex_dic[x],train['Sex'])
    train['Embarked']=map(lambda x: embarked_dic[x],train['Embarked'])

    train['Cabin']=map(lambda x: x[0],train['Cabin'])
    train=train.drop('mean',axis=1)
    
    return train

def dropping(train):
    train=train.drop(['Name','Ticket','Cabin'],axis=1)
    return train

def cleaning(train):
    train=add_title(train)
    train=filling_age(train)
    train=dropping(train)
    train['PassengerId']=train['PassengerId'].astype(int)
    return train

In [300]:
train=cleaning(train)

In [301]:
train.tail()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title
886,887,0,2,0,27.000000,0,0,13.00,0,5
887,888,1,1,1,19.000000,0,0,30.00,0,2
888,889,0,3,1,21.773973,1,2,23.45,0,2
889,890,1,1,0,26.000000,0,0,30.00,1,0
890,891,0,3,0,32.000000,0,0,7.75,2,0

train
---

In [281]:
def random_forest(df,n_estimators=1000,oob_score=True):
    clf=sk.RandomForestClassifier(n_estimators=n_estimators,oob_score=oob_score)
    train_data=df[df.columns[2:]]
    train_truth=df['Survived']
    model=clf.fit(train_data,train_truth)
    print clf.oob_score_
    
    fi = enumerate(clf.feature_importances_)
    cols = train_data.columns
    features=pd.DataFrame([(value,cols[i]) for (i,value) in fi if value > 0.0])
    features.columns=['Importance','Feature']
    features=features.sort(['Importance'],ascending=False).reset_index()
    print features
    
    return clf

In [282]:
clf=random_forest(train)

0.81593714927
   index  Importance   Feature
0      5    0.255936      Fare
1      2    0.231509       Age
2      7    0.173434     Title
3      1    0.140285       Sex
4      0    0.081933    Pclass
5      3    0.052901     SibSp
6      4    0.033131     Parch
7      6    0.030872  Embarked

test
---

In [283]:
test=pd.read_csv('test.csv')
test.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [284]:
test=cleaning(test)

In [285]:
test.shape

(418, 9)

In [286]:
test.tail()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title
413,1305,3,0,32.000000,0,0,8.0500,0,0
414,1306,1,1,39.000000,0,0,108.9000,1,17
415,1307,3,0,38.500000,0,0,7.2500,0,0
416,1308,3,0,32.000000,0,0,8.0500,0,0
417,1309,3,0,7.406471,1,1,22.3583,1,3

In [287]:
test['Survived']=clf.predict(test[test.columns[1:]])

In [288]:
test.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title,Survived
0,892,3,0,34.5,0,0,7.8292,2,0,0
1,893,3,1,47.0,1,0,7.0000,0,1,0
2,894,2,0,62.0,0,0,9.6875,2,0,0
3,895,3,0,27.0,0,0,8.6625,0,0,1
4,896,3,1,22.0,1,1,12.2875,0,1,0

In [289]:
results=test[['PassengerId','Survived']].copy()
results[['PassengerId','Survived']]=results[['PassengerId','Survived']].astype(int)

In [290]:
results.shape

(418, 2)

In [291]:
results.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         1
4          896         0

In [292]:
results.to_csv('random_forest_result_with_title.csv',header=True,index=False)

In [228]:
results.dtypes

PassengerId    int64
Survived       int64
dtype: object